// Задача 63: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от 1 до N.
// N = 5 -> "1, 2, 3, 4, 5"
// N = 6 -> "1, 2, 3, 4, 5, 6"

int num = 128;

void numA (int num)
{
    if(num /10 != 0)
    {
        return;
    }
    else
    {
        numA(num );
        Console.Write(num + " ");
    }

}
numA(num);